In [1]:
import numpy as np
import pandas as pd

In [28]:
np.random.seed(101)

In [2]:
df = pd.DataFrame(np.random.randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [33]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [34]:
df['new'] = df['W'] + df['X']

In [35]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [40]:
df.drop('new',axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [42]:
df.drop('new',axis = 1, inplace = True)

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df.drop('E',axis = 0, inplace = True)

In [45]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [47]:
#Para tomar filas
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [48]:
df.loc['C','X']

0.7401220570561068

In [49]:
df.loc[['C','D'],['X','Y']]

          X         Y
C  0.740122  0.528813
D -0.758872 -0.933237

In [3]:
boolDf = df >0

In [4]:
boolDf

       W      X      Y      Z
A   True  False   True  False
B   True   True  False  False
C   True   True   True   True
D   True   True   True  False
E  False  False  False  False

In [5]:
df[boolDf]

          W         X         Y         Z
A  0.915022       NaN  0.417592       NaN
B  0.037465  0.953319       NaN       NaN
C  0.628715  0.138899  2.258930  0.726852
D  0.280642  1.054783  0.865670       NaN
E       NaN       NaN       NaN       NaN

In [7]:
df['W']> 0

A     True
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [8]:
df[df['W']>0]

          W         X         Y         Z
A  0.915022 -0.762517  0.417592 -1.265952
B  0.037465  0.953319 -0.700372 -0.368144
C  0.628715  0.138899  2.258930  0.726852
D  0.280642  1.054783  0.865670 -1.220901

In [14]:
df[df['X'] > 0 ]['X']

B    0.953319
C    0.138899
D    1.054783
Name: X, dtype: float64

In [15]:
df[df['X'] > 0 ][['X','Y']]

          X         Y
B  0.953319 -0.700372
C  0.138899  2.258930
D  1.054783  0.865670

In [17]:
#Para multiples condiciones: OJO CON LOS PARENTESIS, SE USA & en lugar de AND y | en ves de OR
df[(df['X'] > 0) & (df['Z'] > 0)]

          W         X        Y         Z
C  0.628715  0.138899  2.25893  0.726852

In [19]:
#Aañadir un indice
df.reset_index()

  index         W         X         Y         Z
0     A  0.915022 -0.762517  0.417592 -1.265952
1     B  0.037465  0.953319 -0.700372 -0.368144
2     C  0.628715  0.138899  2.258930  0.726852
3     D  0.280642  1.054783  0.865670 -1.220901
4     E -0.396831 -0.153669 -0.451775 -0.168797

In [20]:
#Para agregar una columna
columna = 'NC W NW CA LA'.split()
df['Estados'] = columna

In [21]:
df

          W         X         Y         Z Estados
A  0.915022 -0.762517  0.417592 -1.265952      NC
B  0.037465  0.953319 -0.700372 -0.368144       W
C  0.628715  0.138899  2.258930  0.726852      NW
D  0.280642  1.054783  0.865670 -1.220901      CA
E -0.396831 -0.153669 -0.451775 -0.168797      LA

In [22]:
#Para convertir una columnna en un index
df.set_index('Estados')

                W         X         Y         Z
Estados
NC       0.915022 -0.762517  0.417592 -1.265952
W        0.037465  0.953319 -0.700372 -0.368144
NW       0.628715  0.138899  2.258930  0.726852
CA       0.280642  1.054783  0.865670 -1.220901
LA      -0.396831 -0.153669 -0.451775 -0.168797

In [37]:
afuera = ['G1','G1','G1','G2','G2','G2']
adentro = [1,2,3,1,2,3,1,2,3]

In [48]:
index_Doble = list(zip(afuera,adentro))
index_Doble = pd.MultiIndex.from_tuples(index_Doble)

In [49]:
df = pd.DataFrame(np.random.randn(6,2), index_Doble, ['A','B'])

In [50]:
df

             A         B
G1 1 -0.906925 -0.483662
   2  0.303078 -0.068823
   3 -0.620127  0.306795
G2 1 -0.724521 -1.118748
   2  0.331556 -0.331608
   3 -0.349592  1.589242

In [51]:
df.loc['G1']

          A         B
1 -0.906925 -0.483662
2  0.303078 -0.068823
3 -0.620127  0.306795

In [53]:
df.loc['G1'].loc[1]

A   -0.906925
B   -0.483662
Name: 1, dtype: float64

In [64]:
df.index_names = ['Grupos', 'Numeros']

In [62]:
df

             A         B
G1 1 -0.906925 -0.483662
   2  0.303078 -0.068823
   3 -0.620127  0.306795
G2 1 -0.724521 -1.118748
   2  0.331556 -0.331608
   3 -0.349592  1.589242

In [73]:
#Obtener filas de diferentes grupos y otras acciones con xs
df.xs(1,level = 1) #El nivel indica el número (en este caso no se pudo asignar el
                    #nombre al indice de los numeros)

           A         B
G1 -0.906925 -0.483662
G2 -0.724521 -1.118748